import React from "react";
import { FontAwesomeIcon } from "@fortawesome/react-fontawesome";
import { faHandPointRight } from "@fortawesome/free-solid-svg-icons";
import "./AboutReact.css";

const AboutReact = () => {
  return (
    <div>
      <div className="first-about">
        <h2>How React Works ? </h2>
        <p>
          <FontAwesomeIcon
            className="icon"
            icon={faHandPointRight}
          ></FontAwesomeIcon>
          একটি জাভাস্ক্রিপ্ট লাইব্রেরি (কোন ফ্রেমওয়ার্ক নয়) যা ঘোষণামূলক কোড
          ব্যবহার করে অনুমানযোগ্য এবং দক্ষ উপায়ে ব্যবহারকারী ইন্টারফেস (UIs)
          তৈরি করে। আপনি এটি ব্যবহার করতে পারেন একক পৃষ্ঠার অ্যাপ্লিকেশন এবং
          মোবাইল অ্যাপ্লিকেশন তৈরি করতে, অথবা আপনি যদি অন্য লাইব্রেরির সাথে এটি
          ব্যবহার করেন তবে জটিল অ্যাপ্লিকেশন তৈরি করতে। React Declarative কোডে
          কাজ করে। Declarative কোড বলতে আমরা কী বুঝি তা দেখানোর জন্য React is a
          Declarative এবং উপাদান-ভিত্তিক | প্রতিক্রিয়া উপাদানগুলি একটি রেন্ডার
          পদ্ধতি প্রয়োগ করে যা ইনপুট ডেটা নেয় এবং কী প্রদর্শন করতে হবে তা ফেরত
          দেয়। এই উদাহরণটি JSX নামে একটি XML-এর মতো সিনট্যাক্স ব্যবহার করে।
          কম্পোনেন্টে প্রবেশ করা ইনপুট ডেটা এই প্রপসের মাধ্যমে রেন্ডার দ্বারা
          অ্যাক্সেস করা যেতে পারে। এটিকে দ্রুততর করতে, প্রতিক্রিয়া একটি
          ভার্চুয়াল DOM প্রয়োগ করে যা মূলত জাভাস্ক্রিপ্টে একটি DOM ট্রি
          উপস্থাপনা করে। সুতরাং যখন এটি DOM-এ পড়তে বা লিখতে হবে, তখন এটি এর
          ভার্চুয়াল উপস্থাপনা ব্যবহার করবে। তারপর ভার্চুয়াল DOM ব্রাউজারের DOM
          আপডেট করার সবচেয়ে কার্যকর উপায় খুঁজে বের করার চেষ্টা করবে |
        </p>
      </div>
      <div className="second-about">
        <h2>Props vs State ?</h2>
        <div>
          <h3>Props</h3>
          <p>
            <FontAwesomeIcon
              className="icon"
              icon={faHandPointRight}
            ></FontAwesomeIcon>
            একটি উপাদান থেকে অন্য উপাদানে ডেটা প্রেরণের জন্য প্রপগুলি ব্যবহার
            করা হয়৷ প্রপগুলি কেবল পঠনযোগ্য৷ প্রপগুলি অপরিবর্তনীয়৷ প্রপগুলি
            শিশু উপাদান দ্বারা অ্যাক্সেস করা যেতে পারে৷ প্রপগুলি উপাদানগুলির
            মধ্যে যোগাযোগ করতে ব্যবহৃত হয়৷ প্রপগুলি বাহ্যিক এবং উপাদান যা কিছু
            রেন্ডার করে তা দ্বারা নিয়ন্ত্রিত৷
          </p>
        </div>
        <div>
          <h3>State</h3>
          <p>
            <FontAwesomeIcon
              className="icon"
              icon={faHandPointRight}
            ></FontAwesomeIcon>
            State পরিবর্তনগুলি অ্যাসিঙ্ক্রোনাস হতে পারে৷ শিশু দ্বারা রাজ্য
            অ্যাক্সেস করা যাবে না৷ components.States এর সাথে গতিশীল পরিবর্তন
            রেন্ডার করার জন্য ব্যবহার করা যেতে পারে উপাদান। রাষ্ট্র অভ্যন্তরীণ
            এবং প্রতিক্রিয়া দ্বারা নিয়ন্ত্রিত উপাদান নিজেই
          </p>
        </div>
      </div>
    </div>
  );
};

export default AboutReact;
